## DaraFrame

In [2]:
"""
A DataFrame is a two-dimensional, labeled data structure in Python provided by the Pandas 
library.Basically it is a collectioon of Series used in Pandas>
It is similar to a table in a database or an Excel sheet, where:
1.Rows represent records.
2.Columns represent different fields (variables)
3.Both rows and columns have labels (index and column names)
"""

'\nA DataFrame is a two-dimensional, labeled data structure in Python provided by the Pandas \nlibrary.Basically it is a collectioon of Series used in Pandas>\nIt is similar to a table in a database or an Excel sheet, where:\n1.Rows represent records.\n2.Columns represent different fields (variables)\n3.Both rows and columns have labels (index and column names)\n'

In [3]:
import numpy as np
import pandas as pd

In [5]:
dict = {
    "Name": ["Supriya", "Prince", "Uttam", "Nisha"],
    "Age": [21,18,22,23],
    "Marks":[99,99,99,99],
    "College":["PK Roy","PW College","IIIT","Delhi University"]
  
}
df = pd.DataFrame(dict);
print(df);

      Name  Age  Marks           College
0  Supriya   21     99            PK Roy
1   Prince   18     99        PW College
2    Uttam   22     99              IIIT
3    Nisha   23     99  Delhi University

In [6]:
data_list=[
    ["Supriya", "Prince", "Uttam", "Nisha"],
    [21,18,22,23],
    [99,99,99,99],
    ["PK Roy","PW College","IIIT","Delhi University"]
]
df_2 = pd.DataFrame(data_list);
print(df_2);

         0           1      2                 3
0  Supriya      Prince  Uttam             Nisha
1       21          18     22                23
2       99          99     99                99
3   PK Roy  PW College   IIIT  Delhi University

In [7]:
data_list=[
    ["Supriya", 21, "Dhanbad", 12542],
    ["Uttam", 22, "Bhagalpur", 4458585],
    ["Nisha", 23, "Delhi", 145555],
    ["Sanyog", 22, "Patna", 44555],
    ["Prince", 18, "Gaya", 78545]
]
df = pd.DataFrame(data_list);
print(df);

         0   1          2        3
0  Supriya  21    Dhanbad    12542
1    Uttam  22  Bhagalpur  4458585
2    Nisha  23      Delhi   145555
3   Sanyog  22      Patna    44555
4   Prince  18       Gaya    78545

In [8]:
columns=["Name","Age", "City", "Salary"];
df = pd.DataFrame(data_list, columns=columns);
print(df);

      Name  Age       City   Salary
0  Supriya   21    Dhanbad    12542
1    Uttam   22  Bhagalpur  4458585
2    Nisha   23      Delhi   145555
3   Sanyog   22      Patna    44555
4   Prince   18       Gaya    78545

In [12]:
print(df["Name"]);
print(df[["Name", "City"]])

0    Supriya
1      Uttam
2      Nisha
3     Sanyog
4     Prince
Name: Name, dtype: object
      Name       City
0  Supriya    Dhanbad
1    Uttam  Bhagalpur
2    Nisha      Delhi
3   Sanyog      Patna
4   Prince       Gaya

In [31]:
df["Designation"] = ["Engineer","Engineer", "Doctor", "IAS Officer", "Engineer"];
print(df);

      Name  Age       City   Salary  Designation
0  Supriya   21    Dhanbad    12542     Engineer
1    Uttam   22  Bhagalpur  4458585     Engineer
2    Nisha   23      Delhi   145555       Doctor
3   Sanyog   22      Patna    44555  IAS Officer
4   Prince   18       Gaya    78545     Engineer

In [34]:
print(df.drop("Designation", axis = 1));
print("Main Data");
print(df);
print("Permanent remove from Main Data");
print(df.drop("Designation", axis = 1, inplace = True));# use inplace = True to delete from main data
print(df);

      Name  Age       City   Salary
0  Supriya   21    Dhanbad    12542
1    Uttam   22  Bhagalpur  4458585
2    Nisha   23      Delhi   145555
3   Sanyog   22      Patna    44555
4   Prince   18       Gaya    78545
Main Data
      Name  Age       City   Salary  Designation
0  Supriya   21    Dhanbad    12542     Engineer
1    Uttam   22  Bhagalpur  4458585     Engineer
2    Nisha   23      Delhi   145555       Doctor
3   Sanyog   22      Patna    44555  IAS Officer
4   Prince   18       Gaya    78545     Engineer
Permanent remove from Main Data
None
      Name  Age       City   Salary
0  Supriya   21    Dhanbad    12542
1    Uttam   22  Bhagalpur  4458585
2    Nisha   23      Delhi   145555
3   Sanyog   22      Patna    44555
4   Prince   18       Gaya    78545

In [38]:
print(df.loc[[0, 1]]);#for selecting rows

      Name  Age       City   Salary
0  Supriya   21    Dhanbad    12542
1    Uttam   22  Bhagalpur  4458585

In [41]:
print(df.iloc[3]);#for selection rows

Name      Sanyog
Age           22
City       Patna
Salary     44555
Name: 3, dtype: object

In [45]:
# for selection subsets from table
print(df.loc[[0, 1]][["Name", "City"]]);

      Name       City
0  Supriya    Dhanbad
1    Uttam  Bhagalpur

In [49]:
print(df[df["Age"]> 20]);#Age greater than 20

      Name  Age       City   Salary
0  Supriya   21    Dhanbad    12542
1    Uttam   22  Bhagalpur  4458585
2    Nisha   23      Delhi   145555
3   Sanyog   22      Patna    44555

In [58]:
print(df);
print(df[(df["Age"] > 20) & (df["City"] == "Dhanbad")]);

      Name  Age       City   Salary
0  Supriya   21    Dhanbad    12542
1    Uttam   22  Bhagalpur  4458585
2    Nisha   23      Delhi   145555
3   Sanyog   22      Patna    44555
4   Prince   18       Gaya    78545
      Name  Age     City  Salary
0  Supriya   21  Dhanbad   12542